Repository: Alexanner/megacrypter
Catalog: application/locale/*/LC_MESSAGES/MegaCrypter.po
Languages: es_es, fr_fr

source: Q: Kissdownloader loads but download speed keeps <span style="color:red">frozen</span> or <span style="color:red">very slow</span>. Why?</h2> <div class="faq_answer"> A: Some MEGA files are stored in more overloaded servers. This problem is related with "file temporarily unavailable" and it appears and fixes itself apparently in random. If download speed is frozen you can wait for it to start or cancel download (be patient while download is stopping), but if download speed is slow, you can try to increment slots.
es_es: P: Kissdownloader carga pero la velocidad de descarga está <span style="color:red">congelada</span> o es <span style="color:red">muy lenta</span>. ¿Por qué?</h2> <div class="faq_answer"> R: Algunos archivos están alojados en servidores de la nube de MEGA más sobrecargados temporalmente. Este problema está relacionado con el error de "archivo temporalmente no disponible" y aparece y se soluciona por sí mismo de forma aleatoria. Si una descarga está congelada, puedes esperar a que arranque o cancelarla (ten paciencia mientras se para la descarga), pero si lo que pasa es que la velocidad es baja, podrías aumentar el número de slots.
fr_fr: Q: Kissdownloader charge mais le téléchargment reste <span style="color:red">figé</span> ou <span style="color:red">trés lent</span>. Pourquoi?</h2> <div class="faq_answer"> R: Certains fichiers MEGA sont stockées dans des serveurs plus surchargées. Ce problème est lié avec "Fichier temporairement indisponible" et il apparaît et se fixe apparemment aléatoire. Si la vitesse de téléchargement est gelé, vous pouvez attendre pour lancer ou annuler télécharger (être patient tout téléchargement s'arrête), mais si la vitesse de téléchargement est lente, vous pouvez essayer d'augmenter fentes.

source: Q: What about video <span style="color:green">streaming</span>?</h2> <div class="faq_answer"> A: You can watch protected video files directly from web with <a href="//www.videolan.org" target="_blank">VLC</a> and <a href="//java.com" target="_blank">Java</a>. Before pressing PLAY button in VLC player, you MUST wait for <em>Kissvideostreamer</em> to load (It's necessary to decrypt MEGA video files on the fly). And, keep in mind that it's still experimental.
es_es: P: ¿Qué me puedes contar sobre el <span style="color:green">streaming</span> de vídeos?</h2> <div class="faq_answer"> R: Pues que es posible reproducir archivos de vídeo directamente desde la web de MegaCrypter mediante <a href="//www.videolan.org" target="_blank">VLC</a> y <a href="//java.com" target="_blank">Java</a>. Antes de pulsar el botón de PLAY en VLC DEBES esperar a que <em>Kissvideostreamer</em> se cargue (Es necesario para descifrar el archivo de MEGA al vuelo). Ten en cuenta, que esta característica es experimental.

source: Q: If i don't want some MegaCrypter link to be active anymore, can i <span style="color:green">disable</span> it?</h2> <div class="faq_answer"> A: MegaCrypter links can't be directly disabled but you can delete or move to another folder your original MEGA file associated with some MegaCrypter link to disable it (and restore it to enable MegaCrypter link again). Remember you can also set an expiration time value when you create MegaCrypter links (see advanced options).
es_es: P: Si no quiero que un enlace de MegaCrypter esté activo nunca más, ¿puedo <span style="color:green">desactivarlo</span>?</h2> <div class="faq_answer"> R: Los enlaces de MegaCrypter no se pueden desactivar directamente, pero puedes eliminar o mover a otra carpeta el archivo original asociado al enlace de MegaCrypter para desactivarlo (y al restaurar dicho archivo el enlace de MegaCrypter volverá a funcionar). Recuerda que también puedes poner un tiempo de caducidad al crear los enlaces de MegaCrypter (mira en opciones avanzadas).
fr_fr: Q: Si je veux qu'un lien de MegaCrypter ne soit plus actif, puis-je le<span style="color:green"> désactiver </span> </h2> <div class="faq_answer"> R: Les liens MegaCrypter ne peuvent pas être directement désactivées, mais vous pouvez supprimer ou déplacer vers un autre dossier de votre fichier MEGA origine associé à un lien de MegaCrypter pour le désactiver (et de le restaurer pour permettre lien MegaCrypter nouveau). N'oubliez pas que vous pouvez également définir une valeur de délai d'expiration lorsque vous créez des liens de MegaCrypter (voir les options avancées).

source: Q: Could you explain MegaCrypter links <span style="color:green">advanced options</span>?</h2> <div class="faq_answer"> A: <p><strong>Expire</strong>: By default MegaCrypter links are eternal (unless original MEGA file is removed), but, in case you need it, you can set an expiration time value from 10 minutes to one year (if your MegaCrypter link expires, your original MEGA file WILL NOT be affected in any way).</p> <p><strong>Append file info</strong>: this option is useful in case you protect a lot of links (or an entire folder) because you won't have to add manually file names to every protected link. (Off by default)</p> <p><strong>Return short urls</strong>: If you need crypted short urls use this option (Off by default).</p> <p><strong>Mask filenames even at download time</strong>: MegaCrypter will hide file name except file extension or episode numbers. (It can be useful against web crawlers).</p> <p><strong>Domain lock</strong>: Using this option, your MegaCrypter links only will be accessible by cliking from some particular domain name (they still can be downloaded using a download manager).</p> <p><strong>Extra info</strong>: Put here any interesting information about your links (64 characters max).</p> <p><strong>Email</strong>: Put here an email to alert you in case that something happens with your links (64 characters max).</p> <p><strong>Password</strong>: You can add an extra security layer to your MegaCryper links. (Just remember passwords are case sensitive).
es_es: P: ¿Puedes explicar las <span style="color:green">opciones avanzadas</span> de los enlaces de MegaCrypter?</h2> <div class="faq_answer"> R: <p><strong>Caducidad</strong>: Por defecto, los enlaces de MegaCrypter son eternos (a menos que el fichero original de MEGA sea borrado), pero, en caso de necesitarlo puedes añadir un tiempo de caducidad que va desde diez minutos hasta un año (cuando el enlace de MegaCrypter caduca, el archivo original de MEGA no se ve afectado de ninguna forma).</p> <p><strong>Añadir información del archivo al enlace</strong>: esta opción es útil en caso de proteger muchos enlaces (o una carpeta entera) porque te evitará tener que añadir manualmente los nombres de los archivos a cada enlace. (Desactivada por defecto)</p> <p><strong>Acortar enlaces protegidos</strong>: Si necesitas enlaces protegidos más cortos usa esta opción (Desactivado por defecto).</p> <p><strong>Enmascarar nombres de archivo incluso al descargar</strong>: MegaCrypter esconderá el nombre del archivo excepto su extensión o el número de un episodio (Puede ser útil contra bots).</p> <p><strong>Protección por dominio</strong>: Usando esta opción, tus enlaces de MegaCrypter sólo serán accesibles haciendo click desde un nombre de dominio en particular (seguirán siendo descargables desde un gestor de descarga).</p> <p><strong>Información extra</strong>: Pon aquí cualquier información interesante sobre tus enlaces (64 caracteres max).</p> <p><strong>Email</strong>: Escribe aquí un email para avisarte en caso de que algo ocurra con tus enlaces (64 characters max).</p> <p><strong>Contraseña</strong>: Puedes añadir una capa extra de seguridad a tus enlaces de MegaCrypter (Recuerda que la contraseña es sensible a minúsculas/mayúsculas).
fr_fr: Q: Pouvez vous m'expliquer les <span style="color:green">options avancées</span> des liens Megacrypter ?</h2> <div class="faq_answer"> R: <p><strong>Expire</strong>:Par défaut les liens de MegaCrypter sont éternels (sauf si le fichier MEGA d'origine est supprimé ), mais , au cas où vous en avez besoin, vous pouvez définir une valeur de délai d'expiration de 10 minutes à un an ( si votre lien de MegaCrypter expire, votre fichier MEGA originaux ne seront pas affectée en aucune façon ) .).</p> <p><strong>Joindre Info du fichier</strong>: cette option est utile dans le cas où vous protéger un grand nombre de liens (ou un répertoire entier) parce que vous n'aurez pas à ajouter manuellement les noms de fichiers à chaque lien protégé. ( Désactivée par défaut)</p> <p><strong>Generer lien court</strong>: Si vous avez besoin d' urls courtes cryptées utiliser cette option ( désactivée par défaut) </p> <p><strong>Masqué les noms des fichiers meme durant le téléchargement</strong>: MegaCrypter se cacheront nom de fichier, sauf extension de fichier ou nombre d'épisodes. ( Il peut être utile contre les robots web ) .</p> <p><strong>Domain lock</strong>: Avec cette option, vos liens MegaCrypter ne seront accessibles en cliquant partir un nom de domaine particulier ( ils peuvent toujours être téléchargées en utilisant un gestionnaire de téléchargement )</p> <p><strong>Extra info</strong>: Mettez ici toutes les informations intéressantes sur vos liens ( 64 caractères maximum) </p> <p><strong>Email</strong>: Mettez ici un email pour vous alerter en cas où quelque chose se trouve que vos liens (64 characters max).</p> <p><strong>Mot de passe</strong>: Vous pouvez ajouter une couche de sécurité supplémentaire pour vos liens d' MegaCrypter . ( Rappelez-vous les mots de passe sont sensibles à la casse )

source: Q: Java killed my family and ate my dog. I hate it!</h2> <div class="faq_answer"> A: I'm so sorry, but that is not a question xD
es_es: P: Java mató a mi familia y se comió a mi perro. ¡Lo odio!</h2> <div class="faq_answer"> R: Lo siento mucho, pero eso no es una pregunta xD
fr_fr: Q: Java killed my family and ate my dog. I hate it!</h2> <div class="faq_answer"> R: I'm so sorry, but that is not a question xD Original joke blague original!!(traduction française par FreeAddons)

source: Wait for
es_es: Espera que
fr_fr: Patientez

source: to load before playing the video
es_es: cargue antes de reproducir el vídeo
fr_fr: avant de lire la video

source: Select all links
es_es: Seleccionar todos los enlaces

source: Terms of Service
es_es: Términos de Uso
fr_fr: Conditions generales d'utilisation

source: TERMS OF SERVICE
es_es: TÉRMINOS DE USO
fr_fr: CONDITIONS GENERALES D'UTILISATION

source: (a.k.a. MC) is an independent web site from
es_es: (alias MC) es un sitio web independiente de
fr_fr: (ou MC) est independant de

source: (a.k.a. MEGA)
es_es: (alias MEGA)
fr_fr: (ou MEGA)

source: MC works as a free anonymous crypted url forwarding service for MEGA links
es_es: MC funciona como un servicio gratuito de redirección anónima y cifrada de enlaces de MEGA
fr_fr: MC est un service anomyme et gratuit de cryptage de liens MEGA

source: MC does not host, index nor stream any MEGA file
es_es: MC no almacena, indexa ni hace streaming de ningún archivo de MEGA
fr_fr: MC n'heberge, n'index et ne stream aucun fichier MEGA

source: MC does not log any kind of user data
es_es: MC no registra ningún tipo de información sobre sus usuarios
fr_fr: MC ne conserve aucune donnée utilisateur

source: MC is not responsible for and has no knowledge and/or control over any content of any MEGA link forwarded from any MC link
es_es: MC no es responsable ni tiene ningún conocimiento y/o control sobre ningún contenido de ningún archivo de MEGA redirigido desde un enlace de MC
fr_fr: MC n'est aucunement responsable des liens et contenus des fichiers MEGA transmis par les liens MC

source: If you do not agree to these terms of service, please leave MC now
es_es: Si no aceptas estos términos de uso, por favor abandona MC ahora mismo
fr_fr: Si vous n'etes pas d'accord avec les conditions d'utilisation,veuillez quittez MC

source: DO NOT CLOSE THIS WINDOW WHILE DOWNLOAD IS IN PROGRESS!
es_es: NO CIERRES ESTA VENTANA MIENTRAS HAYA UNA DESCARGA EN PROGRESO
fr_fr: NE FERMEZ PAS LA FENETRE DURANT LE TELECHARGEMENT!

source: If you want to quit, push
es_es: Si quieres irte, pulsa
fr_fr: Appuyez pour quitter

source: before leaving (you can resume it later)
es_es: antes de salir (puedes continuar luego)
fr_fr: avant de quitter (vous pouvez reprendre plus tard)

source: This link will expire in
es_es: Este enlace caducará en
fr_fr: Le lien expire dans

source: EMPTY FILE
es_es: ARCHIVO VACÍO
fr_fr: FICHIER VIDE

source: Click on FAQ for alternative download methods
es_es: Pincha en la AYUDA para conocer otros métodos de descarga
fr_fr: Cliquez sur FAQ pour les autres methodes de telechargement

source: DOWNLOAD
es_es: DESCARGAR
fr_fr: TELECHARGER

source: Java and VLC plugins are required
es_es: Se requiere Java y el plugin de VLC
fr_fr: Les plugins Java et VLC sont requis

source: WATCH IT NOW
es_es: VER AHORA MISMO
fr_fr: REGARDER

source: You must agree before download file
es_es: Tienes que aceptar los términos de uso antes de poder descargar
fr_fr: Vous devez accepter avant de télécharger

source: I agree with MC
es_es: Acepto los
fr_fr: Je suis d'accord avec MC

source: Loading Kissdownloader, please wait
es_es: Cargando Kissdownloader, por favor espera
fr_fr: Chargement de Kissdownloader,patientez

source: Loading Kissvideostreamer, please wait
es_es: Cargando Kissvideostreamer, por favor espera
fr_fr: Chargement de Kissvideostreamer, patientez

source: It's limited to
es_es: Está limitado a
fr_fr: Limité a

source: (If tiny url option is true, this will be ignored).
es_es: (Si las urls cortas están activadas, esto será ignorado).
fr_fr: (Si l'option url court est activé,cette option est ignoré).

source: MEGA cloud temporarily unavailable
es_es: MEGA está temporalmente no disponible
fr_fr: MEGA temporairement indisponible

source: MEGA file temporarily unavailable
es_es: Archivo de MEGA temporalmente no disponible
fr_fr: Fichier MEGA temporairement indisponible

source: MEGA file not found!
es_es: ¡El archivo de MEGA no existe!
fr_fr: Le fichier MEGA n'existe pas!

source: MEGA file is blocked!
es_es: ¡Archivo de MEGA bloqueado!
fr_fr: Le fichier MEGA est bloqué!

source: Bad MEGA file!
es_es: ¡Archivo de MEGA incorrecto!
fr_fr: Le fichier MEGA est corrompu!

source: MEGA file not found (user account was terminated)
es_es: ¡El archivo de MEGA no existe! (la cuenta de usuario fue cancelada)
fr_fr: Le fichier MEGA n' existe pas! (le compte est clos)

source: Bad MC link!
es_es: ¡Enlace MC incorrecto!
fr_fr: Lien MC n'existe pas!

source: Blocked MC link!
es_es: ¡Enlace MC bloqueado!
fr_fr: Le lien MC est bloqué!

source: Expired MC link!
es_es: ¡Enlace MC caducado!
fr_fr: Le lien MC a expiré!

source: You MUST visit this link from
es_es: DEBES visitar este enlace desde
fr_fr: Vous DEVEZ acceder a ce lien depuis

source: Copy URL to clipboard
es_es: Copiar URL al portapapeles
fr_fr: Copier l'URL dans le clipboard

source: Click to copy URL
es_es: Haz click para copiar el enlace al portapapeles
fr_fr: Cliquez pour copier l'URL dans le clipboard

source: Enable advanced options
es_es: Activar opciones avanzadas
fr_fr: Activer les options avancées

source: Web access was not enabled for this link
es_es: El acceso web no fue activado para este enlace
fr_fr: L'accès Web n'a pas été activé pour ce lien

source: Warning!
es_es: ¡Atención!
fr_fr: Avertissement!

source: Put here an email to alert you in case that something happens with your links
es_es: Escribe aquí un email para avisarte en caso de que algo ocurra con tus enlaces
fr_fr: Mettez ici un email pour vous alerter en cas où quelque chose se trouve que vos liens

source: Something to report?
es_es: ¿Algo que reportar?
fr_fr: Quelque chose à déclarer?

source: You must agree with <a href="/tos">TOS</a> before you can use our API
es_es: Debes aceptar los <a href="/tos">TDU</a> antes de poder utilizar nuestra API
fr_fr: Vous devez accepter <a href="/tos">TDU</a> avant de pouvoir utiliser notre API

source: In order to get a <strong>reporter id</strong> you must send first a valid <a href="//en.wikipedia.org/wiki/Digital_Millennium_Copyright_Act" target="_blank">DMCA</a> complaint (or about any other abuse) to: <strong>abuse.megacrypter@gmail.com</strong>
es_es: Para obtener un <strong>reporter id</strong> primero debe enviar una reclamación <a href="//en.wikipedia.org/wiki/Digital_Millennium_Copyright_Act" target="_blank">DMCA</a> válida (o de otro tipo de abuso) a: <strong>abuse.megacrypter@gmail.com</strong>

source: I hereby state that I have a good faith belief that the sharing of copyrighted material at the location above is not authorized by the copyright owner, its agent, or the law
es_es: Por la presente declaro que tengo una creencia de buena fe de que el uso compartido de material con derechos de autor en la ubicación anterior no está autorizado por el propietario del copyright, su agente o la ley
fr_fr: Je déclare par la présente que j'ai une croyance de bonne foi que le partage de matériel protégé à l'emplacement ci-dessus n'est pas autorisée par le propriétaire du droit d'auteur, son agent ou la loi

source: Remove URLs
es_es: Eliminar URLs
fr_fr: Supprimer les URL

source: were successfully removed.
es_es: fueron eliminadas correctamente
fr_fr: ont été éliminés avec succès.

source: Your reporter ID is not valid!
es_es: ¡Su reporter id no es válido!
fr_fr: Votre ID de journaliste n'est pas valide!

source: No valid URLs to remove!
es_es: ¡No hay URLs válidas para eliminar!
fr_fr: Pas URL valides à retirer!

source: Captcha code was not valid!
es_es: ¡El captcha introducido no era correcto!
fr_fr: Captcha code n'est pas valide!

source: Put here the URLs you want to remove
es_es: Introduzca aquí las URLs que quiera eliminar
fr_fr: Mettez ici les URL que vous souhaitez supprimer

source: Put here the ID you received by email
es_es: Ponga aquí el ID que recibió por email
fr_fr: Mettez ici l'ID que vous avez reçu par e-mail

source: As MC user, you MUST NOT use our service to perform ANY KIND of illegal activity including infringing any copyright or other proprietary rights of any person or entity.
es_es: Como usuario de MC, NO te está permitido usar nuestro servicio para llevar a cabo ningún tipo de actividad ilegal incluyendo infringir el copyright (u otros derechos) de ninguna persona o entidad
fr_fr: En tant qu'utilisateur MC, vous ne devez pas utiliser notre service pour effectuer tout type d'activité illégale y compris violer aucun droit d'auteur ou autres droits de propriété de toute personne ou entité

source: You must agree before
es_es: Tienes que aceptar antes
fr_fr: Vous devez accepter avant

source: Remember to keep an eye on
es_es: No olvides echar un vistazo de vez en cuando a
fr_fr: N'oubliez pas de garder un oeil sur

source: Q: Why MC shows <span style="color:red">"Web access was not enabled for this link"</span> ?</h2> <div class="faq_answer"> A: Because that link was created WITHOUT DOMAIN LOCK protection (see advanced options below) and it can be only downloaded using a download manager.
es_es: P: ¿Por qué se muestra <span style="color:red">"El acceso web no fue activado para este enlace"</span>?</h2><div class="faq_answer">R: Porque ese enlace fue creado <b>SIN USAR la PROTECCIÓN POR DOMINIO</b> (mira más abajo en opciones avanzadas) y sólo se puede descargar usando un gestor de descargas.
fr_fr: P: Pourquoi lien montre <span style="color:red">"L'accès Web n'a pas été activé pour ce lien"</span>?</h2><div class="faq_answer">R: Parce que votre lien a été créé <b>sans DOMAIN LOCK protection</b> (voir les options avancées ci-dessous) et on ne peut les télécharger à l'aide d'un gestionnaire de téléchargement.

source: EMERGENCY STOP
es_es: PARADA DE EMERGENCIA
fr_fr: ARRÊT D'URGENCE

source: We are undergoing maintenance. Please come back later.
es_es: Realizando tareas de mantenimiento. Por favor, vuelve más tarde.
fr_fr: Nous sommes Voir votre. S'il vous plaît revenir plus tard.

source: Q: What if Java shows <span style="color:red">"your security settings have blocked a self-signed application from running"</span>?</h2> <div class="faq_answer"> A: <br /><iframe id="how_to_frame" width="500" height="304" frameborder="0" src="//www.youtube.com/embed/hCIt6NSqACg?rel=0" allowfullscreen /></iframe><br />1) Go to the Java Control Panel (On Windows Click Start and then Configure Java)<br /> 2) Click on the Security tab<br /> 3) Click on the Edit Site List button<br /> 4) Click Add in the Exception Site List window and introduce https://megacrypter.com<br /> <img src="//www.java.com/en/img/download/add_url.jpg"><br />More info <a href="//www.java.com/en/download/help/java_blocked.xml" target="_blank">here</a>
es_es: P: ¿Y si Java muestra <span style="color:red">"tus ajustes de seguridad han bloqueado la ejecución de una aplicación auto-firmada"</span>?</h2> <div class="faq_answer"> R: <br /><iframe id="how_to_frame" width="500" height="304" frameborder="0" src="//www.youtube.com/embed/hCIt6NSqACg?rel=0" allowfullscreen /></iframe><br />1) Panel de control de Java (En Windows Inicio > Panel de control > Java)<br /> 2) Click en la pestaña de seguridad<br /> 3) Click en Editar Lista de Sitios<br /> 4) Click en añadir a la lista de excepciones e introducir https://megacrypter.com<br /> <img src="//www.java.com/en/img/download/add_url.jpg"><br />Más info <a href="//www.java.com/en/download/help/java_blocked.xml" target="_blank">aquí</a>

source: Remember that protected links will only be downloadable with a manager unless you activate the <em>domain-lock</em> protection (see advanced options).
es_es: Recuerda que los enlaces protegidos sólo serán descargables mediante un gestor a menos que actives la <em>protección por dominio</em> (ver opciones avanzadas)
fr_fr: Rappelez-vous que les liens protégées ne seront téléchargeables avec un gestionnaire Sauf si vous activez DOMAIN LOCK protection (voir les options avancées).

source: POST requests
fr_fr: requetes POST
