Repository: Alexanner/megacrypter
Catalog: application/locale/*/LC_MESSAGES/MegaCrypter.po
Languages: es_es, fr_fr

source: How-to
es_es: Tutorial
fr_fr: Tuto

source: FAQ
es_es: AYUDA

source: TOS
es_es: TDU
fr_fr: CDU

source: Protect your MEGA links from prying eyes
es_es: Protege tus enlaces de MEGA de curiosos
fr_fr: Proteger vos liens des regards indiscret

source: Share your files, not your links
es_es: Comparte tus archivos, no tus enlaces
fr_fr: Partage tes fichiers,pas tes liens

source: Encrypt links
es_es: Proteger enlaces
fr_fr: Crypter les liens

source: Advanced options
es_es: Opciones avanzadas
fr_fr: Options avancées

source: Expire
es_es: Caducidad

source: Never
es_es: Nunca
fr_fr: Jamais

source: minutes
es_es: minutos

source: hour
es_es: hora
fr_fr: heure

source: day
es_es: día
fr_fr: Jour

source: week
es_es: semana
fr_fr: semaine

source: weeks
es_es: semanas
fr_fr: semaines

source: month
es_es: mes
fr_fr: mois

source: months
es_es: meses
fr_fr: mois

source: year
es_es: año
fr_fr: ans

source: Append file info to encrypted links
es_es: Añade información del archivo a los enlaces
fr_fr: Ajout d'information dans les liens cryptés

source: Append file info (slower)
es_es: Añadir información del archivo al enlace (más lento)
fr_fr: Ajout d'informations de fichiers (plus lent)

source: Returns short crypted links
es_es: Devuelve los enlaces acortados
fr_fr: Génerer des liens courts cryptés

source: Return short urls (slower)
es_es: Acortar enlaces protegidos (más lento)
fr_fr: Liens courts (plus lent)

source: Check it for maximum security against crawlers.
es_es: Úsalo para conseguir máxima seguridad contra bots
fr_fr: Cocher pour une sécurité maximale contre les robots.

source: Mask filenames even at download time
es_es: Enmascarar nombres de archivo incluso al descargar
fr_fr: Masquer le nom du fichier durant le telechargement

source: Domain lock
es_es: Protección por dominio
fr_fr: Limiter au domaine:

source: Links will be accessible ONLY from this domain
es_es: Los enlaces serán accesibles únicamente desde este dominio
fr_fr: Les liens ne seront accessible que depuis ce domaine

source: Extra info
es_es: Información extra
fr_fr: Info complementaire

source: Put here any relevant information about the links.
es_es: Pon aquí cualquier dato interesante sobre los enlaces
fr_fr: Mettez ici toute l'information pertinente sur les liens.

source: Password
es_es: Contraseña
fr_fr: Mot de passe

source: Case sensitive!
es_es: ¡Sensible a minúsculas/mayúsculas!
fr_fr: Sensible a la case

source: Beware that password protected links might not yet be compatible with some download managers!
es_es: ¡Ten en cuenta que los enlaces protegidos con contraseña pueden no funcionar en algunos gestores de descarga!
fr_fr: Attention le mot de passe peut etre incompatble avec certains downloader managers!

source: Oops, something (bad) happened
es_es: Oops, algo (malo) ha pasado
fr_fr: Oups, quelquechose a echoué

source: API DOCUMENTATION
es_es: DOCUMENTACIÓN DE LA API
fr_fr: DOCUMENTATION API

source: It's coding time, yaba daba doo!
es_es: ¡Es hora de programar, yaba daba doo!
fr_fr: C'est le moment de coder, tadaaa!

source: Are you developing a download manager? Good news, Megacrypter has a (beta) API ;)
es_es: ¿Estás programando un gestor de descargas? Buenas noticias, MegaCrypter dispone de una API pública ;)
fr_fr: Vous developpez un gestionnaire de download?Bonne nouvelle,Megacrypter a une (beta)API ;)

source: <strong>For NOW</strong> without API-KEY
es_es: <strong>Por ahora</strong> sin API-KEY

source: Let's see how it works
es_es: Vamos a ver cómo funciona
fr_fr: Regardons comment ça marche

source: with
es_es: con
fr_fr: et

source: uses
es_es: utiliza
fr_fr: utilise

source: HTTP POST requests
es_es: peticiones HTTP POST

source: Crypt-request
es_es: Petición crypt

source: for protecting a mega link list
es_es: para proteger una lista de enlaces de MEGA

source: Optional params
es_es: Parámetros opcionales
fr_fr: Paramètre optionel

source: Expiration values
es_es: Valores de caducidad

source: never
es_es: nunca
fr_fr: jamais

source: default
es_es: por defecto
fr_fr: defaut

source: Tiny url option is false by default
es_es: La opción de urls cortas está desactivada por defecto
fr_fr: L'option Tiny url est desactivée par défaut

source: Append file info option is false by default
es_es: La opción de añadir la información del archivo está desactivada por defecto
fr_fr: L'option info supplementaire est desactivée par défaut

source: Hide name option is false by default
es_es: La opción de enmascarar los nombres de fichero está desactivada por defecto
fr_fr: L'option Masqué les noms est desactivée par défaut

source: Passwords are case-sensitive
es_es: Las contraseñas son sensibles a minúsculas/mayúsculas
fr_fr: Mot de passe sensible a la case

source: Referer is not required to include
es_es: No es necesario que el referer incluya

source: Extra-info is limited to
es_es: La información extra está limitada a
fr_fr: Info complémentaire limitée à

source: chars
es_es: caracteres

source: Note: link list is limited to
es_es: Nota: la lista de enlaces está limitada a
fr_fr: Note:le lien est limité a

source: Crypt-response
es_es: Respuesta crypt

source: <strong>Info-request</strong> (for retrieving some file information)
es_es: <strong>Petición info</strong> (para obtener diversa información sobre un enlace)

source: Info-response
es_es: Respuesta info

source: About password protected files
es_es: En relación a los enlaces protegidos con contraseña
fr_fr: A propos des fichiers protégés par mot de passe

source: File name, file key, and extra-info will be returned crypted using AES CBC (PKCS7) with md5(password) as 128 bits key and zero-iv. Moreover, double-md5 password hash will be returned to allow you checking password
es_es: El nombre del archivo, su clave de cifrado, y su información extra serán devueltos cifrados con AES CBC (PKCS7) usando el hash MD5 de la contraseña como clave de 128 bits y un IV nulo. Además, un hash md5 doble será devuelto para permitir verificar la contraseña
fr_fr: Nom du fichier, clé de fichier, et extra-info seront retournés cryptées en utilisant AES CBC (PKCS7) avec md5 (mot de passe) comme clé de 128 bits et zéro-iv. En outre, hash md5 double sera retourné pour vous permettre vérifiant mot de passe

source: Follow this <strong>algorithm</strong> to decrypt crypted fields
es_es: Sigue este <strong>algoritmo</strong> para descifrar los campos cifrados

source: <strong>Dl-request</strong> (for getting a temporary url to the (crypted) file)
es_es: <strong>Petición Dl</strong> (para obtener una URL temporal al archivo (cifrado))

source: Dl-response
es_es: Respuesta Dl

source: <strong>Error-response</strong> (because shit happens...)
es_es: <strong>Respuesta de error</strong>

source: Error codes
es_es: Códigos de error

source: and ERROR CODES from MEGA API
es_es: y CÓDIGOS DE ERROR de la API de MEGA

source: Don't be evil
es_es: Pórtate bien
fr_fr: Don't be evil (soyez bienveillant)

source: Frequently Asked Questions
es_es: AYUDA
fr_fr: Foire Aux Questions

source: Q: What is <span style="color:green">MegaCrypter</span>?</h2> <div class="faq_answer">A: MegaCrypter is a free anonymous crypted url forwarding service for MEGA links. Its main goal is to protect your MEGA account encrypting your links <strong>BEFORE</strong> sending them through a channel you don't trust at all.
es_es: P: ¿Qué es <span style="color:green">MegaCrypter</span>?</h2> <div class="faq_answer">R: MegaCrypter es un servicio gratuito de redirección anónima y cifrada de enlaces de MEGA. Su función principal es proteger tu cuenta de MEGA cifrando tus enlaces <strong>ANTES</strong> de enviarlos a través de un canal que no sea de tu plena confianza.
fr_fr: Q: <span style="color:green">MegaCrypter</span> c'est quoi ?</h2> <div class="faq_answer">R: MegaCrypter est un service anonyme et gratuit crypté de redirection d'URL pour les liens MEGA. Son principal objectif est de protéger votre MEGA compte. Pour ce faire, il crypte vos liens <strong> AVANT </ strong> partage à travers certains canaux vous n'avez pas confiance du tout.

source: Q: How can i <span style="color:green">download</span> MegaCrypter links?</h2> <div class="faq_answer">A:<p><strong>Option 1 (only domain-lock links):</strong> download from your browser (<a href="//java.com" target="_blank">Java plugin</a> is required and remember you must agree with <a href="/tos">TOS</a>).</p> <p><strong>Option 2:</strong> use some download manager like <a href="//www.google.com/search?q=jdownloader+2" target="_blank">Jdownloader 2 beta</a>, <a href="//www.google.com/search?q=pyload" target="_blank">Pyload</a>, <a href="//www.google.com/search?q=mipony" target="_blank">Mipony</a>, <a href="//www.google.com/search?q=downdroid" target="_blank">DownDroid</a>, <a href="//www.google.com/search?q=ponydroid" target="_blank">PonyDroid</a> (<strong>pay attention to the versions</strong>).</p> <p><strong>Option 3:</strong> use this <a href="/megadown" target="_blank">bash script</a></p> <p><strong>Option 4:</strong> code your own download application using MegaCrypter public <a href="/api_doc">API</a>.
es_es: P: ¿Cómo puedo <span style="color:green">descargar</span> los enlaces de MegaCrypter?</h2> <div class="faq_answer">R:<p><strong>Opción 1 (sólo enlaces con domain-lock activado):</strong> descárgalos desde tu navegador (el <a href="//java.com" target="_blank">plugin de Java</a> es necesario y recuerda que tienes que aceptar los <a href="/tos">TDU</a>).</p> <p><strong>Opción 2:</strong> utiliza algún gestor de descarga como <a href="//www.google.com/search?q=jdownloader+2" target="_blank">Jdownloader 2 beta</a>, <a href="//www.google.com/search?q=pyload" target="_blank">Pyload</a>, <a href="//www.google.com/search?q=mipony" target="_blank">Mipony</a>, <a href="//www.google.com/search?q=downdroid" target="_blank">DownDroid</a>, <a href="//www.google.com/search?q=ponydroid" target="_blank">PonyDroid</a> (<strong>presta atención a las versiones</strong>).</p> <p><strong>Opción 3:</strong> usa este <a href="/megadown" target="_blank">bash script</a></p> <p><strong>Opción 4:</strong> programa tu propia aplicación de descarga usando la <a href="/api_doc">API</a> de MegaCrypter.

source: Q: How <span style="color:green">safe</span> is MegaCrypter?</h2> <div class="faq_answer"> A: Your MEGA links (and other sensitive data) travel encrypted over <a href="//en.wikipedia.org/wiki/HTTP_Secure" target="_blank">HTTPS</a> On the other hand, MegaCrypter links use <a href="//en.wikipedia.org/wiki/Advanced_Encryption_Standard" target="_blank">AES (256 bits)</a> and are decrypted on the fly at server side. If you are concerned about your privacy, you may like to know that MegaCrypter <strong>DOES NOT LOG ANYTHING</strong> about you or your links.
es_es: P: ¿Cómo es de <span style="color:green">seguro</span> MegaCrypter?</h2> <div class="faq_answer"> A: Tus enlaces de MEGA (y otra información sensible) viajan cifrados sobre <a href="//en.wikipedia.org/wiki/HTTP_Secure" target="_blank">HTTPS</a> Por otro lado, los enlaces de MegaCrypter usan <a href="//en.wikipedia.org/wiki/Advanced_Encryption_Standard" target="_blank">AES (256 bits)</a> y se descifran en el servidor. Si te preocupa tu privacidad, te intereserá saber que MegaCrypter <strong>NO ALMACENA NINGUNA INFORMACIÓN</strong> sobre ti o tus enlaces.

source: Q: Can i protect MEGA <span style="color:green">folders</span>?</h2><div class="faq_answer"> A: Yes. MegaCrypter will return you a protected link for every file that is inside the folder at this moment.
es_es: P: ¿Puedo proteger <span style="color:green">carpetas</span>?</h2><div class="faq_answer"> R: Sí. MegaCrypter te devolverá un enlace protegido por cada fichero que contenga la carpeta en ese momento.
fr_fr: Q: Puis-je protéger mes <span style="color:green">dossiers</span> MEGA</h2> <div class="faq_answer"> R: Oui. MegaCrypter vous renverra un lien protégé pour chaque fichier contenu dans le dossier concerné.

source: Q: <span style="color:green">Where</span> are files downloaded from?</h2> <div class="faq_answer"> A: MEGA files are directly downloaded from MEGA cloud to your computer (MegaCrypter does not host nor stream any MEGA file).
es_es: P: ¿<span style="color:green">Desde dónde</span> se descargan los archivos?</h2> <div class="faq_answer"> R: Los archivos se descargan directamente desde la nube de MEGA a tu ordenador (MegaCrypter no almacena ni hace streaming de ningún archivo de MEGA).
fr_fr: Q: <span style="color:green">D'ou</span> viennent les fichiers télécharger depuis?</h2> <div class="faq_answer"> R: Les fichiers MEGA sont téléchargeables directement depuis le cloud MEGA sur votre ordinateur (MegaCrypter n'héberge ne diffuse ou n'importe aucun fichier MEGA).

source: Q: I don't have <span style="color:green">Java</span> browser plugin. What should i install?</h2> <div class="faq_answer"> A: all you need is <a href="//java.com" target="_blank">here</a>.
es_es: P: No tengo el plugin de <span style="color:green">Java</span>. ¿Qué necesito instalar?</h2> <div class="faq_answer"> R: todo lo que necesitas está <a href="//java.com" target="_blank">aquí</a>.

source: Q: I have installed Java, but plugin does <span style="color:red">not load :(</span></h2> <div class="faq_answer"> A: First, reboot your system. If problem persists, read <a href="//java.com/en/download/help/enable_browser.xml" target="_blank">this</a> and <a href="//java.com/en/download/faq/chrome.xml" target="_blank">this</a> (You can also test your Java installation <a href="//java.com/en/download/testjava.jsp" target="_blank">here</a>).
es_es: P: Ya he instalado Java pero el plugin <span style="color:red">no arranca :(</span></h2> <div class="faq_answer"> R: Antes de nada reinicia. Si el problema persiste, lee <a href="//java.com/en/download/help/enable_browser.xml" target="_blank">esto</a> y <a href="//java.com/en/download/faq/chrome.xml" target="_blank">esto otro</a> (Puedes testear si te funciona Java <a href="//java.com/en/download/testjava.jsp" target="_blank">aquí</a>).

source: Q: Ok, i have now Java working but it asks me to load <em>Kissdownloader</em> and it says it could be <span style="color:red">dangerous</span>!</h2> <div class="faq_answer"> A: <strong>DO NOT WORRY!!</strong> <em>Kissdownloader</em> is our self-signed Java applet for download and decrypt MEGA files. Java warning it's default behavior for applets that have disc access permission. <strong>It does not contain any kind of adware or spyware</strong>. (You can check "always trust" to skip future warnings from megacrypter).
es_es: P: Vale, ya me funciona Java pero me pide permiso para ejecutar <em>Kissdownloader</em> ¡y dice que puede ser <span style="color:red">peligroso</span>!</h2> <div class="faq_answer"> R: <strong>¡¡NO TE ASUSTES!!</strong> <em>Kissdownloader</em> es una pequeña aplicación necesaria para poder descargar y descifrar los ficheros de MEGA. El aviso de Java es algo rutinario porque el downloader necesita permiso de acceso al disco. Te garantizamos que <strong> no contiene ninguna clase de spy/adware</strong>. (Puedes marcar "confiar siempre en este sitio" para evitar futuros avisos desde megacrypter).
fr_fr: Q: Ok,J'ai Java qui fonctionne mais il me dit lors du chargement de <em>Kissdownloader</em> que cela peut etre <span style="color:red">dangereux</span>!</h2> <div class="faq_answer"> R: <strong>PAS DE PANIQUE!!</strong> <em>Kissdownloader</em>est notre applet Java auto-signé pour les fichiers MEGA télécharger et décrypter. Java avertissant son comportement par défaut pour les applets qui ont l'autorisation d'accès au disque. <strong> Il ne contient aucun type d'adware ou spyware </ strong>. (Vous pouvez vérifier "toujours confiance" pour ignorer les avertissements de futures megacrypter).

source: Q: I'm downloading a file with <em>Kissdownloader</em>... Can i <span style="color:green">stop and resume</span> download later?</h2> <div class="faq_answer"> A: yes, you can (even closing your browser), but before quitting you MUST push <span class="error_message">STOP DOWNLOAD</span> button. (Just remember next time, you must use the <strong>same filename</strong> if you want to resume your previous download).
es_es: P: Mientras descargo un archivo con <em>Kissdownloader</em>... ¿Puedo <span style="color:green">detener la descarga y continuarla</span> más tarde?</h2> <div class="faq_answer"> R: Sí (incluso cerrando el navegador o apagando tu equipo) pero para ello, antes de salir DEBES pulsar el botón <span class="error_message">STOP DOWNLOAD</span>. (Y recuerda que para continuar la descarga, la próxima vez DEBES usar <strong>el mismo nombre de archivo</strong>).
fr_fr: Q: Je télécharge avec <em>Kissdownloader</em>... Puis je <span style="color:green">stopper et reprendre</span> le téléchargement plus tard?</h2> <div class="faq_answer"> R: Oui, vous le pouvez (même après fermeture de votre navigateur), mais avant de quitter vous devez appuyer sur le bouton <span class="error_message">STOP DOWNLOAD</span> . (Rappelez-vous la prochaine fois, vous devez utiliser <strong> le même nom de fichier </strong> si vous voulez reprendre votre dernier téléchargement).

source: Q: What are <span style="color:green">slots</span>?</h2> <div class="faq_answer"> A: Download slots are very useful if you want to maximize your download speed. Try increasing them step by step until your download speed is maximum, but keep in mind that slots consume CPU/memory resources and might produce network overhead, so try to keep slots value as minimum as possible.
es_es: P: ¿Para qué sirven los <span style="color:green">slots</span>?</h2> <div class="faq_answer"> R: Los slots son muy útiles para aprovechar toda tu capacidad de descarga. Mientras estés descargando, prueba a subir poco a poco hasta que tu velocidad de descarga sea máxima, pero recuerda que los slots consumen recursos de CPU/memoria y pueden producir "overhead", así que intenta mantener su valor lo más bajo posible.
fr_fr: Q: Qu'est ce que les<span style="color:green">slots</span>?</h2> <div class="faq_answer"> R: Les slots de téléchargement sont très utiles si vous voulez maximiser votre vitesse de téléchargement. Essayez de les augmenter étape par étape jusqu'à ce que votre vitesse de téléchargement soit maximale, mais gardez à l'esprit que les créneaux consomment CPU / mémoire et les ressources pourraient produire une surcharge du réseau, alors essayez de garder la valeur des créneaux aussi minimum que possible.

source: Q: Can i download several files at the <span style="color:green">same time</span>?</h2> <div class="faq_answer"> A: Of course you can ;)
es_es: P: ¿Puedo descargar varios archivos al <span style="color:green">mismo tiempo</span>?</h2> <div class="faq_answer"> A: Sí, claro ;)
fr_fr: Q: Puis télécharger des fichiers <span style="color:green">simultanement</span>?</h2> <div class="faq_answer"> R: Oui bien sur ! ;)

source: Q: How does file <span style="color:green">integrity check</span> work?</h2> <div class="faq_answer"> A: It's quite simple. AFTER download is finished, Kissdownloader generates file's <a href="//en.wikipedia.org/wiki/CBC-MAC" target="_blank">CBC-MAC</a> and compares it against original files's CBC-MAC (which is derivated from mega link key). If both codes are equal, your file is (99.9% prob) <em>bit-by-bit</em> identical to the original.
es_es: P: ¿Cómo funciona el <span style="color:green">chequeo de integridad</span>?</h2> <div class="faq_answer"> R: Es bastante simple. Después de descargar el archivo, Kissdownloader calcula su código <a href="//en.wikipedia.org/wiki/CBC-MAC" target="_blank">CBC-MAC</a> y lo compara con el código original (el cual se extrae de la clave de descifrado del archivo). Si ambos códigos coinciden, el archivo descargado es (99.9% prob) <em>bit-a-bit</em> idéntico al original.

source: Q: Kissdownloader says my file is <span style="color:red">damaged</span>. What does it mean?</h2> <div class="faq_answer"> A: There are basically two scenarios for this error: <p>Scenario 1: Your downloaded file was corrupted due some Internet connection problem (try to download again but if error persists, you are probably in scenario 2).</p> <p>Scenario 2: MEGA file was corrupted during upload (file must be re-uploaded).
es_es: P: Kissdownloader dice que mi archivo está <span style="color:red">dañado</span>. ¿Qué significa eso?</h2> <div class="faq_answer"> R: Hay dos escenarios posibles para este error: <p>Escenario 1: El archivo descargado se ha corrompido durante la descarga debido a algún fallo en la conexión a internet. (Bájalo de nuevo, pero si el error persiste, probablemente estés en el escenario 2).</p> <p>Escenario 2: El archivo se corrompió durante su subida a MEGA (es necesario resubirlo).
fr_fr: Q: Kissdownloader dit que mon dossier est <span style="color:red"> endommagé </span>. Qu'est-ce que cela signifie? </h2> <div class="faq_answer"> R: Il existe essentiellement deux scénarios possibles pour cette erreur: <p> Scénario 1:. Votre fichier téléchargé est corrompu à cause un problème de connexion à Internet (essayez de télécharger à nouveau, mais si l'erreur persiste, vous êtes probablement dans le scénario 2) </p> <p> Scénario 2: fichier MEGA a été endommagé pendant le téléchargement (fichier doit être re-téléchargés).

source: Q: What does it mean <span style="color:red"><em>file temporarily unavailable</em></span>?</h2> <div class="faq_answer"> A: It means what it says xD Jokes apart, this "random" error it's related to MEGA servers maintenance. It can be fixed in a couple of minutes, hours or days...
es_es: P: ¿Qué significa <span style="color:red"><em>archivo temporalmente no disponible</em></span>?</h2> <div class="faq_answer"> R: Significa eso mismo xD Bromas aparte, este error "aleatorio" está relacionado con el mantenimiento de los servidores de MEGA. Puede solucionarse en un par de minutos, horas o días...
fr_fr: Q: Que signifie <span style="color:red"> <em> fichier temporairement indisponible </ em> </span>?</h2> <div class="faq_answer"> R: Cela signifie ce qui est ecrit! Blagues xD intervalle, cette erreur "aléatoire" est lié à MEGA maintenance des serveurs. Il peut être fixé en quelques minutes, heures ou jours ...
