Repository: Alexanner/megacrypter
Catalog: application/locale/*/LC_MESSAGES/MegaCrypter.po
Languages: es_es, fr_fr

source: Q: How can i <span style="color:green">download</span> MegaCrypter links?</h2> <div class="faq_answer">A:<p><strong>Option 1 (only domain-lock links):</strong> download from your browser (<a href="http://java.com" target="_blank">Java plugin</a> is required and remember you must agree with <a href="/tos">TOS</a>).</p> <p><strong>Option 2:</strong> use some download manager like <a href="http://www.google.com/search?q=jdownloader+2" target="_blank">Jdownloader 2 beta</a>, <a href="http://www.google.com/search?q=pyload" target="_blank">Pyload</a> , or <a href="http://www.google.com/search?q=mipony" target="_blank">Mipony</a>, <a href="http://www.google.com/search?q=downdroid" target="_blank">DownDroid</a>, <a href="http://www.google.com/search?q=ponydroid" target="_blank">PonyDroid</a> (<strong>pay attention to the versions</strong>).</p> <p><strong>Option 3:</strong> use this <a href="megadown" target="_blank">bash script</a></p> <p><strong>Option 4:</strong> code your own download application using MegaCrypter public <a href="/api_doc">API</a>.
fr_fr: Q: Comment <span style="color:green">télécharger</span> des liens MegaCrypter ?</h2> <div class="faq_answer">R:<p><strong>Option 1 (uniquement liens avec domain-lock):</strong> telecharger depuis votre navigateur (<a href="http://java.com" target="_blank">Le Java plugin</a> is requis and souvenez vous que vous devez accepter les <a href="/tos">CGU</a>).</p> <p><strong>Option 2:</strong> utiliser un gestionnaire de download manager comme <a href="http://www.google.com/search?q=jdownloader+2" target="_blank">Jdownloader 2 beta</a>, <a href="http://www.google.com/search?q=pyload" target="_blank">Pyload</a>, <a href="http://www.google.com/search?q=mipony" target="_blank">Mipony</a>, <a href="http://www.google.com/search?q=downdroid" target="_blank">DownDroid</a>, <a href="http://www.google.com/search?q=ponydroid" target="_blank">PonyDroid</a> (<strong>faites attention aux versions</strong>).</p> <p><strong>Opción 3:</strong> utilisez cette <a href="megadown" target="_blank">bash script</a></p> <p><strong>Option 4:</strong> coder votre propre application en utilisant MegaCrypter public <a href="/api_doc">API</a>.

source: Q: How <span style="color:green">safe</span> is MegaCrypter?</h2> <div class="faq_answer"> A: Your MEGA links (and other sensitive data) are encrypted with <a href="http://en.wikipedia.org/wiki/Advanced_Encryption_Standard" target="_blank">AES-256</a> before being sent to the server. MegaCrypter links also use AES-256 and are decrypted on the fly at server side. If you are concerned about your privacy, you may like to know that MegaCrypter <strong>DOES NOT LOG ANYTHING</strong> about you or your links.
fr_fr: Q: Quel<span style="color:green">securité</span>utilise MegaCrypter?</h2> <div class="faq_answer"> R: Vos liens MEGA (et d'autres données sensibles) sont cryptées avec <a href="http://en.wikipedia.org/wiki/Advanced_Encryption_Standard" target="_blank"> AES-256 </a> avant d'être envoyer au serveur. Les liens de MegaCrypter utilisent également AES-256 et sont déchiffrées à la volée, du côté de serveur. Si vous êtes préoccupé par votre vie privée, vous aimeriez savoir que <strong> MegaCrypter n'enregistre pas RIEN </strong> sur vous ou sur vos liens.

source: Q: I don't have <span style="color:green">Java</span> browser plugin. What should i install?</h2> <div class="faq_answer"> A: all you need is <a href="http://java.com" target="_blank">here</a>.
fr_fr: Q: Je n'est pas le<span style="color:green">Java</span> plugin. Comment puis je l'installer?</h2> <div class="faq_answer"> R: tout est <a href="http://java.com" target="_blank">ici</a>.

source: Q: I have installed Java, but plugin does <span style="color:red">not load :(</span></h2> <div class="faq_answer"> A: First, reboot your system. If problem persists, read <a href="http://java.com/en/download/help/enable_browser.xml" target="_blank">this</a> and <a href="http://java.com/en/download/faq/chrome.xml" target="_blank">this</a> (You can also test your Java installation <a href="http://java.com/en/download/testjava.jsp" target="_blank">here</a>).
fr_fr: Q: J'ai installé le plugin Java,mais il ne<span style="color:red">charge pas :(</span></h2> <div class="faq_answer"> R: En premier, rebooter votre systeme. Si le problème persiste, lisez <a href="http://java.com/en/download/help/enable_browser.xml" target="_blank">ceci</a> et <a href="http://java.com/en/download/faq/chrome.xml" target="_blank">ceci</a> (Vous pouvez tester java <a href="http://java.com/en/download/testjava.jsp" target="_blank">ici</a>).

source: Q: How does file <span style="color:green">integrity check</span> work?</h2> <div class="faq_answer"> A: It's quite simple. AFTER download is finished, Kissdownloader generates file's <a href="http://en.wikipedia.org/wiki/CBC-MAC" target="_blank">CBC-MAC</a> and compares it against original files's CBC-MAC (which is derivated from mega link key). If both codes are equal, your file is (99.9% prob) <em>bit-by-bit</em> identical to the original.
fr_fr: Q: Comment est verifié <span style="color:green">l'integrité des fichiers</span> ?</h2> <div class="faq_answer"> R: C'est très simple. Une fois le téléchargement terminé, Kissdownloader génère un fichier <a href="http://en.wikipedia.org/wiki/CBC-MAC" target="_blank">CBC-MAC</a> et le compare au CBC-MAC des fichiers d'origine (qui est dérivé de celui de la clé de liaison méga). Si les deux codes sont identiques, votre fichier est (à 99,9% près) <em> bit par bit </ em> identique à l'original.

source: Q: What about video <span style="color:green">streaming</span>?</h2> <div class="faq_answer"> A: You can watch protected video files directly from web with <a href="http://www.videolan.org" target="_blank">VLC</a> and <a href="http://java.com" target="_blank">Java</a>. Before pressing PLAY button in VLC player, you MUST wait for <em>Kissvideostreamer</em> to load (It's necessary to decrypt MEGA video files on the fly). And, keep in mind that it's still experimental.
fr_fr: Q: A propos du video <span style="color:green">streaming</span>?</h2> <div class="faq_answer"> R: Vous pouvez regarder des fichiers vidéo protégés directement à partir du Web avec <a href="http://www.videolan.org" target="_blank">VLC</a> et <a href ="http :/ / java.com"target =" _blank ">Java</a>. Avant d'appuyer sur le bouton PLAY dans le lecteur VLC, vous devez attendre que <em> Kissvideostreamer </ em> soit chargé (Il est nécessaire pour déchiffrer à la volée les fichiers vidéo MEGA ). Et, gardez à l'esprit que c'est encore au stade expérimental.

source: Select all (%tot_links%) links
fr_fr: Selectionnez les (%tot_links%) liens

source: In order to get a <strong>reporter id</strong> you must send first a valid <a href="http://en.wikipedia.org/wiki/Digital_Millennium_Copyright_Act" target="_blank">DMCA</a> complaint (or about any other abuse) to: <strong>abuse.megacrypter@gmail.com</strong>
fr_fr: Afin d'obtenir un <strong>reporter id</strong> vous devez envoyer d'abord une plainte <a href="http://en.wikipedia.org/wiki/Digital_Millennium_Copyright_Act" target="_blank">DMCA</a> valide (ou sur tout autre abus) pour: <strong>abuse.megacrypter@gmail.com</strong>
